<?php
/**
 * @Auth: cmz <393418737@qq.com>
 */
return array(
    100000 => '操作成功',
    100001 => '帐号已禁用',
    100002 => '用户名或密码不能为空',
    100003 => '密码验证失败',
    100004 => '请输入正确的安全码',
    100005 => '安全码认证失败',
    100006 => '请确认数据是否导入',

    100007 => '原密码错误',
    100008 => '两次输入的密码必须一致',
    100009 => '更改密码失败',

    100010 => '你已经绑定过密保卡了',
    100011 => '绑定过密保卡成功',
    100012 => '绑定过密保卡失败,请联系管理员',
    100013 => '请先绑定密保卡',
    100014 => '重置密保卡失败,请联系管理员',
    100015 => '密保卡已过期',
    100016 => '解除密保卡绑定成功',
    100017 => '密保卡解除绑定失败,请联系管理员',

    100018 => '角色名不能为空',
    100019 => '权限菜单不能为空',
    100020 => '已有相同的角色名存在',
    100021 => '添加角色失败',
    100022 => '用户名和权限菜单不能为空',
    100023 => '要编辑的角色ID错误',
    100024 => '编辑角色权限失败,请联系管理员',
    100025 => '没有找到该管理员',
    100026 => '没有发现ACL菜单',

    100030 => '权限不足',

    100040 => '重置密码成功',
    100041 => '重置密码失败',

    100200 => '保存配置失败，请检查目录权限',

    200001 => '系统错误，请联系管理员!',
    200010 => '请先登录',

    200015 => '该IP已经被屏蔽，请联系管理员',

    200020 => '不支持的请求类型',
    200025 => '作者未设置二维码，暂时无法打赏',
    200030 => '请求所需参数不足',
    200040 => '不支持的操作类型',

    200050 => '没有找到要上传的文件',
    200051 => '上传所需参数不足',

    200060 => '图片上传失败',

    200100 => '话题不存在',
    200200 => '不支持的发布类型',
    200201 => '表单已过期，请返回后重新提交',
    200210 => '标题不能为空',
    200211 => '发起问题失败，请联系管理员',
    200212 => '发帖失败，请联系管理员',
    200213 => '发布文章失败，请联系管理员',
    200220 => '该问题不存在或已经被删除',
    200222 => '文章内容不能为空',
    200223 => '帖子内容不能为空',

    200230 => '文章不存在或已经被删除',

    200240 => '发布评论失败, 请联系管理员',

    200300 => '账号已存在',
    200301 => '账号不能为空',
    200302 => '两次输入的密码不一致',
    200303 => '注册失败，请联系管理员',
    200304 => '账号长度为2~12个字符',
    200305 => '账号只支持英文字母数字和下划线',
    200310 => '更新用户信息失败，请联系管理员',
    200320 => '昵称长度为2~12个字符',
    200321 => '昵称已经被使用了',
    200322 => '昵称不能为空',
    200330 => '该帐号已被禁止登录',

    200401 => '账号不存在',
    200402 => '密码错误',
    200410 => '原密码不能为空',
    200411 => '请输入新密码',
    200412 => '两次输入的密码不一致',
    200420 => '输入的邀请码无效',
    200421 => '无效的邀请链接',
    200422 => '邀请链接已失效',
    200423 => '该邀请已无效',
    200424 => '重置邀请码失败,请联系管理员',

    200430 => '不支持的第三方平台',
    200431 => '请指定第三方平台',
    200432 => 'openid不能为空',
    200433 => 'access token不能为空',
    200440 => '第三方平台登录失败, 请联系管理员',
    200441 => '授权失败, 请联系管理员',
    200450 => '绑定失败, 请先解除原绑定',
    200451 => '绑定失败, 请联系管理员',
    200452 => '创建帐号失败, 请联系管理员',
    200453 => '创建帐号失败, 该平台帐号已与其他用户绑定',
    200454 => '请输入现有帐号',
    200455 => '现有帐号密码不能为空',
    200456 => '该平台帐号已与其他用户绑定',
    200457 => '该帐号已与其他第三方平台帐号绑定',
    200460 => '解除绑定失败, 请联系管理员',

    200500 => '关注失败，请联系管理员',
    200501 => '关注用户不存在',
    200502 => '参数不足,关注失败',
    200503 => '关注失败,请联系管理员',
    200510 => '关注的话题不存在',
    200520 => '关注的内容不存在',
    200521 => '取消关注失败,请联系管理员',
    200522 => '关注时发生错误,请联系管理员',
    200523 => '批量关注失败，请联系管理员',

    200600 => '收藏的内容不存在',
    200601 => '取消收藏失败,请联系管理员',
    200602 => '收藏时发生错误,请联系管理员',

    200610 => '追加内容不能为空',
    200611 => '追加内容所需参数不足',
    200612 => '追加文章所需参数不足',
    200613 => '追加帖子所需参数不足',

    200700 => '操作所需参数不足',

    200800 => '请输入你想邀请的人的名字',
    200801 => '邀请失败, 请联系管理员',
    200802 => '邀请成功, 别忘了关注主题哟',
    200803 => '对方已经回答过该问题, 请不要再次邀请',
    200804 => '邀请失败, 对方已经忽略该问题',
    200810 => '忽略邀请失败, 请联系管理员',

    200909 => '发表评论失败, 请联系管理员',
    200910 => '请填写评论内容',
    200911 => '评论内容为2~126个字符',

    201010 => '私信内容不能为空',
    201011 => '收信人不能是自己',
    201012 => '发送失败，请联系管理员',
    201013 => '私信不能超过126个字符',
    201014 => '消息不存在，或已经被删除',
    201015 => '删除消息失败，请联系管理员',
    201016 => '删除消息失败，请联系管理员',
    201017 => '删除会话失败，请联系管理员',
);
